---
type: IntegerRange
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# IntegerRange

`Autodesk.Revit.DB.IntegerRange` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | High | 2015 | `public int High { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Low | 2015 | `public int Low { get ; }` |